from datetime import date
import random
import locale


locale.setlocale(locale.LC_ALL, 'ru_RU.UTF-8')
quotes_by_day = {
    "понедельник": {
        "Мотивация и цели": [
            "Большие цели требуют ежедневных маленьких шагов.",
            "Мотивация приходит и уходит, дисциплина остаётся.",
            "Если цель не пугает — она слишком мала.",
            "Начни сейчас, идеального момента не будет.",
            "Каждый день — это шанс стать лучше, чем вчера."
        ]
    },

    "вторник": {
        "Жизнь и смысл": [
            "Жизнь — это не ожидание подходящего момента, а умение его создать.",
            "Смысл жизни определяется тем, как ты живёшь, а не тем, сколько ты знаешь.",
            "Мы находим смысл не в ответах, а в вопросах.",
            "Важнее не сколько лет в жизни, а сколько жизни в годах.",
            "Жизнь ценна, пока ты осознаёшь её ценность."
        ]
    },

    "среда": {
        "Успех и карьера": [
            "Успех — это сумма правильно повторённых действий.",
            "Карьеру строят не таланты, а настойчивые.",
            "Работай над навыками, а не над оправданиями.",
            "Успех любит тех, кто готов учиться постоянно.",
            "Твоя карьера — отражение твоих решений."
        ]
    },

    "четверг": {
        "Мышление и философия": [
            "Мы видим мир не таким, какой он есть, а таким, какие мы есть.",
            "Мысли формируют реальность быстрее, чем обстоятельства.",
            "Сомнение — начало мудрости.",
            "Философия начинается с вопроса «почему».",
            "То, как ты думаешь, важнее того, что ты знаешь."
        ]
    },

    "пятница": {
        "Отношения и общение": [
            "Качество жизни напрямую зависит от качества общения.",
            "Настоящие отношения строятся на честности, а не удобстве.",
            "Умение слушать ценнее умения говорить.",
            "Люди запоминают не слова, а чувства, которые ты им оставил.",
            "Отношения — это работа, а не удача."
        ]
    },

    "суббота": {
        "Страхи, ошибки и неудачи": [
            "Ошибка — это опыт, если ты сделал выводы.",
            "Страх исчезает, когда ты действуешь.",
            "Неудача — это часть пути, а не конец.",
            "Бояться нормально, сдаваться — выбор.",
            "Каждая ошибка делает тебя сильнее, если ты продолжаешь."
        ]
    },

    "воскресенье": {
        "Сила и характер": [
            "Сила характера проявляется в сложные моменты.",
            "Настоящая сила — в умении не сдаваться.",
            "Характер формируется действиями, а не словами.",
            "Сильные люди продолжают, когда другим тяжело.",
            "Выдержка важнее таланта."
        ]
    }
}

historical_facts = {
    "понедельник": [
        "1969 — первый успешный запуск космического корабля «Аполлон-11» к Луне.",
        "1876 — Александр Белл демонстрирует работу телефона.",
        "1923 — в Германии введена рейхсмарка."
    ],
    "вторник": [
        "1945 — окончание Второй мировой войны в Европе.",
        "1960 — Нельсон Мандела арестован в ЮАР.",
        "2005 — запуск YouTube в публичный доступ."
    ],
    "среда": [
        "1990 — официальное объединение Германии.",
        "1955 — основан НАСА (National Aeronautics and Space Administration).",
        "1983 — впервые запущен терминал ARPANET для электронной почты."
    ],
    "четверг": [
        "1920 — основана Лига Наций.",
        "1963 — Мартин Лютер Кинг начал кампанию за гражданские права в США.",
        "1998 — первый тестовый запуск космического телескопа Хаббл после ремонта."
    ],
    "пятница": [
        "2004 — запуск Facebook Марком Цукербергом.",
        "1947 — объявлен первый транзисторный компьютер ENIAC.",
        "1986 — катастрофа на Чернобыльской АЭС."
    ],
    "суббота": [
        "1963 — Мартин Лютер Кинг произносит речь «У меня есть мечта».",
        "1912 — экспедиция Титаника завершает свою первую и последнюю поездку.",
        "1997 — публикация первого тома Гарри Поттера на английском языке."
    ],
    "воскресенье": [
        "1876 — Александр Белл получает патент на телефон.",
        "1969 — Woodstock Festival официально открыт.",
        "1989 — падение Берлинской стены."
    ]
}


def print_quote(day: str, amount: int = 1) -> str:
   
    
    main_dct = quotes_by_day[day] # словарь без дня
    print(f"Сегодня у нас {day}, к этому дню у нас принадлежит тема '{' '.join(main_dct.keys())}' ⬇️")
    quotes = main_dct.values()
    quotes = list(quotes)[0] # список цитат
   
    result = list(random.sample(quotes, k=min(amount, len(quotes))))
    for sentense in result:
        print("Цитата:", sentense)

def print_present_date(current_date: int) -> str:
    print(current_date.strftime(f"Сегодня у нас %d.%m.%Y, %A, %B"))

def print_interesting_historical_fact(date: str, quantity: int = 1) -> str:
    
    facts = list(historical_facts[date])
    
    result = list(random.sample(facts, k=min(quantity, len(facts))))
    if quantity == 1:
        print(f"На {date} у нас есть вот такой факт:")
    else:
        print(f"На {date} у нас есть вот такие факты:")
    for sentense in result:
        print(f"Факт: {''.join(sentense)}")

def main():
    current_date = date.today()
    nameDate = current_date.strftime('%A')
    print("В данной конскольной программе вы получите цитату из разных жизненных категориях, интересные исторические факты и текущую дату")
    
    
    while True:
        print(
        "\n1. Показать цитату"
        f"\n2. Интересный исторический факт, произошедший в {nameDate.title()}"
        "\n3. Показать сегоднюшнюю дату"
        "\n4. Выйти"
        )
        choice = input("Выберите действие: ")
        match choice:
            case '1':
                try:
                    amount = int(input("Сколько цитат вы хотите получить (всего 5): "))
                    print_quote(nameDate, amount)
                except ValueError:
                    print("По умолчанию - 1")  
                    print_quote(nameDate, amount=1)
            case '2':
                try:
                    quantity = int(input("Сколько фактов вы хотите получить (всего 3): "))
                    print_interesting_historical_fact(nameDate, quantity)
                except ValueError:
                    print("По умолчанию - 1")   
                    print_interesting_historical_fact(nameDate, quantity=1)
            
            case '3':
                print_present_date(current_date)
            
            case '4':
                print("Выходим...")
                break
            
            case _:
                print("Неверный ввод")



if __name__ == '__main__':
    main()